#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>
#include <time.h>
#include <stdbool.h>

typedef unsigned long long Bstr;

void E(); //加密算法
void D(); //解密算法
void Bstr2char(Bstr* text, char* array); //将Bstr变量转化为2进制字符串
void char2Bstr(char* array, Bstr* text); //将2进制字符串转化为Bstr变量
bool valid_key(char* k); //判断密钥合法性 
void replace(char* input, int* table, char* output, int n); //实现置换
void key_schedule(char k[56], char subkey[16][48]);//轮子密钥
void encrypt(char p[64], char subkey[16][48], char c[64]);//加密函数
void F(char* r, char* k, char* R);//F函数

//pc1置换表
int pc1Table[56] =
{
	57,49,41,33,25,17,9,1,
	58,50,42,34,26,18,10,2,
	59,51,43,35,27,19,11,3,
	60,52,44,36,63,55,47,39,
	31,23,15,7,62,54,46,38,
	30,22,14,6,61,53,45,37,
	29,21,13,5,28,20,12,4
};
//左移矩阵
int loopTable[16] =
{
	1,1,2,2,2,2,2,2,1,2,2,2,2,2,2,1
};
//pc2置换表
int pc2Table[48] =
{
	14,17,11,24,1,5,
	3,28,15,6,21,10,
	23,19,12,4,26,8,
	16,7,27,20,13,2,
	41,52,31,37,47,55,
	30,40,51,45,33,48,
	44,49,39,56,34,53,
	46,42,50,36,29,32
};
//置换IP表
int ipTable[64] =
{
	58,50,42,34,26,18,10,2,
	60,52,44,36,28,20,12,4,
	62,54,46,38,30,22,14,6,
	64,56,48,40,32,24,16,8,
	57,49,41,33,25,17,9,1,
	59,51,43,35,27,19,11,3,
	61,53,45,37,29,21,13,5,
	63,55,47,39,31,23,15,7
};
//E扩展置换表
int extendTable[48] =
{
	32,1,2,3,4,5,
	4,5,6,7,8,9,
	8,9,10,11,12,13,
	12,13,14,15,16,17,
	16,17,18,19,20,21,
	20,21,22,23,24,25,
	24,25,26,27,28,29,
	28,29,30,31,32,1
};
//S盒子
int sBox[8][4][16] =
{
	//S1
	14,4,13,1,2,15,11,8,3,10,6,12,5,9,0,7,
	0,15,7,4,14,2,13,1,10,6,12,11,9,5,3,8,
	4,1,14,8,13,6,2,11,15,12,9,7,3,10,5,0,
	15,12,8,2,4,9,1,7,5,11,3,14,10,0,6,13,
	//S2
	15,1,8,14,6,11,3,4,9,7,2,13,12,0,5,10,
	3,13,4,7,15,2,8,14,12,0,1,10,6,9,11,5,
	0,14,7,11,10,4,13,1,5,8,12,6,9,3,2,15,
	13,8,10,1,3,15,4,2,11,6,7,12,0,5,14,9,
	//S3
	10,0,9,14,6,3,15,5,1,13,12,7,11,4,2,8,
	13,7,0,9,3,4,6,10,2,8,5,14,12,11,15,1,
	13,6,4,9,8,15,3,0,11,1,2,12,5,10,14,7,
	1,10,13,0,6,9,8,7,4,15,14,3,11,5,2,12,
	//S4
	7,13,14,3,0,6,9,10,1,2,8,5,11,12,4,15,
	13,8,11,5,6,15,0,3,4,7,2,12,1,10,14,9,
	10,6,9,0,12,11,7,13,15,1,3,14,5,2,8,4,
	3,15,0,6,10,1,13,8,9,4,5,11,12,7,2,14,
	//S5
	2,12,4,1,7,10,11,6,8,5,3,15,13,0,14,9,
	14,11,2,12,4,7,13,1,5,0,15,10,3,9,8,6,
	4,2,1,11,10,13,7,8,15,9,12,5,6,3,0,14,
	11,8,12,7,1,14,2,13,6,15,0,9,10,4,5,3,
	//S6
	12,1,10,15,9,2,6,8,0,13,3,4,14,7,5,11,
	10,15,4,2,7,12,9,5,6,1,13,14,0,11,3,8,
	9,14,15,5,2,8,12,3,7,0,4,10,1,13,11,6,
	4,3,2,12,9,5,15,10,11,14,1,7,6,0,8,13,
	//S7
	4,11,2,14,15,0,8,13,3,12,9,7,5,10,6,1,
	13,0,11,7,4,9,1,10,14,3,5,12,2,15,8,6,
	1,4,11,13,12,3,7,14,10,15,6,8,0,5,9,2,
	6,11,13,8,1,4,10,7,9,5,0,15,14,2,3,12,
	//S8
	13,2,8,4,6,15,11,1,10,9,3,14,5,0,12,7,
	1,15,13,8,10,3,7,4,12,5,6,11,0,14,9,2,
	7,11,4,1,9,12,14,2,0,6,10,13,15,3,5,8,
	2,1,14,7,4,10,8,13,15,12,9,0,3,5,6,11
};
//P换位表
int pTable[32] =
{
	16,7,20,21,
	29,12,28,17,
	1,15,23,26,
	5,18,31,10,
	2,8,24,14,
	32,27,3,9,
	19,13,30,6,
	22,11,4,25
};
//逆置换IP^-1表
int ipReverseTable[64] = {
	40,8,48,16,56,24,64,32,
	39,7,47,15,55,23,63,31,
	38,6,46,14,54,22,62,30,
	37,5,45,13,53,21,61,29,
	36,4,44,12,52,20,60,28,
	35,3,43,11,51,19,59,27,
	34,2,42,10,50,18,58,26,
	33,1,41,9,49,17,57,25
};

int main() {
	int model = 0;
	printf("选择加/解密(1/2) :");
	scanf("%d", &model);
	getchar();
	if (model == 1) {
		E();
	}
	else if (model == 2) {
		D();
	}
	else
	{
		printf("加解密方法选择错误");
	}
	return 0;
}

//加密算法
void E() {
	Bstr  plaintext = 0, key = 0, ciphertext = 0;
	char K[64], k[56], subkey[16][48], p[64], c[64];
	clock_t a, b;
	printf("请输入明文:");
	scanf("%llx", &plaintext);
	getchar();
	printf("请输入密钥:");
	scanf("%llx", &key);
	getchar();
	a = clock();
    Bstr2char(&key, K);
	if (valid_key(K)) {
		replace(K, pc1Table, k, 56);
		key_schedule(k, subkey);
		Bstr2char(&plaintext, p);
		encrypt(p, subkey, c);
		char2Bstr(c, &ciphertext);
		printf("密文为:0x%llx", ciphertext);
	}
	else {
		printf("密钥不合法");
	}
	b = clock();
	printf("\n运行时长为:%dms", b - a);
}

//解密算法
void D() {
}

//将Bstr变量转化为2进制字符串
void Bstr2char(Bstr* text, char* array) {
	for (int i = 63; i >= 0 ; i--) {
		*(array + i) = (char)((*text >> (63-i)) & 1);
	}
}

//将2进制字符串转化为Bstr变量
void char2Bstr(char* array, Bstr* text) {
	for (int i =0; i < 64; i++) {
		*text = ((Bstr) * (array + i)) | (*text << 1);
	}
}

//判断密钥合法性 
bool valid_key(char*k) {
	for (int i = 0; i < 8; i++) {
		char flag = 0;
		for (int j = 0; j < 8; j++) {
			flag += *(k + 8 * i + j);
		}
		if (!(flag & 1)) {
			return false;
		}
	}
	return true;
}

//实现置换
void replace(char* input, int* table, char* output, int n) {
	for (int i = 0; i < n; i++) {
		*(output + i) = *(input + *(table + i) - 1);
	}
}

//轮子密钥
void key_schedule(char k[56], char subkey[16][48]) {
	for (int i = 0; i < 16; i++) {
		if (loopTable[i] == 1) {
			char c1 = *k;
			char d1 = *(k + 28);
			for (int j = 0; j < 27; j++) {
				*(k + j) = *(k + j + 1);
				*(k + j + 28) = *(k + j + 29);
			}
			*(k + 27) = c1;
			*(k + 55) = d1;
		}
		else {
			char c1 = *k, c2 = *(k + 1);
			char d1 = *(k + 28), d2 = *(k + 29);
			for (int j = 0; j < 13; j++) {
				*(k + 2 * j) = *(k + 2 * (j + 1));
				*(k + 2 * j + 1) = *(k + 2 * (j + 1) + 1);
				*(k + 2 * j + 28) = *(k + 2 * (j + 1) + 28);
				*(k + 2 * j + 29) = *(k + 2 * (j + 1) + 29);
			}
			*(k + 26) = c1;
			*(k + 27) = c2;
			*(k + 54) = d1;
			*(k + 55) = d2;
		}
		replace(k, pc2Table, subkey[i], 48);
	}
}

//加密函数
void encrypt(char p[64], char subkey[16][48], char c[64]) {
	char pp[64], L[32], R[32], r[32];
	replace(p, ipTable, pp, 64);
	for (int i = 0; i < 32; i++) {
		L[i] = pp[i];
		R[i] = pp[i + 32];
	}
	for (int i = 0; i < 16; i++) {
		F(r, subkey[i], R);
		for (int j = 0; j < 32; j++) {
			r[j] = L[j] ^ r[j];
			L[j] = R[j];
			R[j] = r[j];
		}
	}
	for (int i = 0; i < 32; i++) {
		pp[i] = R[i];
		pp[i + 32] = L[i];
	}
	replace(pp, ipReverseTable, c, 64);
}

// F函数
void F(char* r, char* k, char* R) {
	char RR[48], rr[32];
	replace(R, extendTable, RR, 48);
	for (int i = 0; i < 48; i++) {
		RR[i] = RR[i] ^ *(k+i);
	}
	for (int i = 0; i < 8; i++) {
		int t = sBox[i][RR[i * 6] * 2 + RR[i * 6 + 5]][8 * RR[i * 6 + 1] + 4 * RR[i * 6 + 2] + 2 * RR[i * 6 + 3] + RR[i * 6 + 4]];
		for (int j = 3; j > -1; j--) {
			*(rr + i * 4 + j) = (char)(t >> (3-j)) & 1;
		}
	}
	replace(rr, pTable, r, 32);
}